#### Handling Null Values
- 1. Filling Null Values : mean, mode
- 2. Removing Null Values

In [21]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'X1':[1,np.nan,np.nan,np.nan,3],
             'X2':[2,5,8,np.nan,4],
             'X3': ["Yes","No","No",np.nan,"No"],
             'Y':[3,6,np.nan,np.nan,4]})
df

    X1   X2   X3    Y
0  1.0  2.0  Yes  3.0
1  NaN  5.0   No  6.0
2  NaN  8.0   No  NaN
3  NaN  NaN  NaN  NaN
4  3.0  4.0   No  4.0

In [22]:
## to check null values
df.isnull().sum()

X1    3
X2    1
X3    1
Y     2
dtype: int64

#### 1. Fill null values using Mean

In [23]:
x1_mean = df["X1"].mean()
df["X1"].fillna(x1_mean,inplace=True)

x2_mean = df["X2"].mean()
df["X2"].fillna(x2_mean,inplace=True)

Y_mean = df["Y"].mean()
df["Y"].fillna(Y_mean,inplace=True)

In [24]:
df

    X1    X2   X3         Y
0  1.0  2.00  Yes  3.000000
1  2.0  5.00   No  6.000000
2  2.0  8.00   No  4.333333
3  2.0  4.75  NaN  4.333333
4  3.0  4.00   No  4.000000

#### 2. Fill null values using Mode

In [27]:
mode = df["X3"].mode()[0]
df["X3"].fillna(mode,inplace=True)

In [29]:
df.head()

    X1    X2   X3         Y
0  1.0  2.00  Yes  3.000000
1  2.0  5.00   No  6.000000
2  2.0  8.00   No  4.333333
3  2.0  4.75   No  4.333333
4  3.0  4.00   No  4.000000

#### 2. remove null values

In [30]:
df = pd.DataFrame({'X1':[1,np.nan,np.nan,np.nan,3],
             'X2':[2,5,8,np.nan,4],
             'X3': ["Yes","No","No",np.nan,"No"],
             'Y':[3,6,np.nan,np.nan,4]})
df.head()

    X1   X2   X3    Y
0  1.0  2.0  Yes  3.0
1  NaN  5.0   No  6.0
2  NaN  8.0   No  NaN
3  NaN  NaN  NaN  NaN
4  3.0  4.0   No  4.0

In [32]:
df.dropna(how="all")

    X1   X2   X3    Y
0  1.0  2.0  Yes  3.0
1  NaN  5.0   No  6.0
2  NaN  8.0   No  NaN
4  3.0  4.0   No  4.0

In [33]:
df.dropna(how="any")

    X1   X2   X3    Y
0  1.0  2.0  Yes  3.0
4  3.0  4.0   No  4.0